cf_billing/InformationRegisters/бестПоставщикиУслугНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПоставщикиУслугНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоставщикПокупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргВидыУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыУслуг</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>бестИспользоватьТемпературныйКоэффициентПоВоде</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестИспользоватьТемпературныйКоэффициентПоВоздуху</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестКоличествоЧасовНештатнойРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощади</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлощадиМКД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗависитОтУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКоэффициентСдерживанияРостаПлаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректироватьГодовойОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректироватьИндивидуальныйОбъемСУчетомОДПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьПоСостояниюНаНачалоРасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативДляИндивидуальных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сезонность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СезонностьНастраивается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитПотери</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСоциальнойНормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыОпределенияСоциальнойНормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТовары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВыводить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИспользоватьПовыщающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПоставщикУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРаспределятьТолькоПоОДПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСезонность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдлаитьэнргВидыСезонности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСоциальныйНормативРавенНормативуПотребления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособОпределенияНормы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыОпределенияНормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособРасчетаНорматива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаНорматива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособРасчетаОбъема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособРасчетаОбъема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУменьшатьБазуЕслиВсеСПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДосчётаРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСпособыДосчётаРесурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестЗависитОтУслугиПоПотерям</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестОсновнаяУслугаДляРасчетаБалансовымМетодом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьЗависимостьЕслиБольшеОднойТочки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестИспользоватьРасчетПоМощности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестИспользоватьРасчетЭлектроэнергии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРасчетРеактивнойЭнергии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставляющиеУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтправлятьИнфПоПУВГИСЖКХ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормулыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СпособНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСпособНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестТовары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗависимыеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаЗависитОт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставляющиеБалансовыхУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/бестПоставщикиУслугНП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает данные поставщиков.
//
// Параметры:
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  Период			-	Дата.
//  Поставщик		-	СправочникСсылка.энргКонтрагенты.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
//  Услуга			-	СправочникСсылка.энргВидыУслуг.
//  СоставныеУслуги	-	СправочникСсылка.энргВидыУслуг.
// 
// Возвращаемое значение:
//   РузультатЗапроса.
//
Функция ПолучитьДанныеПоставщиков(Организация, Район, Период, Поставщик = Неопределено, ТочкаУчета = Неопределено, Услуга = Неопределено,СоставныеУслуги = Ложь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПоставщикиУслугНП.ТочкаУчета КАК ТочкаУчета,
		|	бестПоставщикиУслугНП.Услуга КАК Услуга,
		|	бестПоставщикиУслугНП.Поставщик КАК Поставщик,
		|	бестПоставщикиУслугНП.ЧастьСоставной КАК ЧастьСоставной
		|ИЗ
		|	РегистрСведений.бестПоставщикиУслугНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ТочкаУчета = &ТочкаУчета
		|				И ЧастьСоставной = &Услуга) КАК бестПоставщикиУслугНП
		|ГДЕ
		|	бестПоставщикиУслугНП.Поставщик = &Поставщик";
	
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(Поставщик) Тогда
		Запрос.УстановитьПараметр("Поставщик", Поставщик);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестПоставщикиУслугНП.Поставщик = &Поставщик", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТочкаУчета) Тогда
		Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТочкаУчета = &ТочкаУчета", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Услуга) Тогда
		Если СоставныеУслуги Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧастьСоставной = &Услуга", "Услуга = &Услуга");
		КонецЕсли;
		Запрос.УстановитьПараметр("Услуга", Услуга);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЧастьСоставной = &Услуга", "Истина");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает действующие приборы учета вместе с поставщиками.
//
// Параметры:
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  Период			-	Дата.
//  МВТ				-	МенеджерВременныхТаблиц.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьДействующиеПриборыУчетаВместеСПоставщиками(Организация, Район, Период, МВТ) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Итог.ОбъектРасчета КАК ОбъектРасчета,
		|	Итог.ТочкаУчета КАК ТочкаУчета,
		|	Итог.Шкала КАК Шкала,
		|	Итог.Услуга КАК Услуга,
		|	Итог.ВидДифференцированности КАК ВидДифференцированности,
		|	Итог.ТарифнаяЗона КАК ТарифнаяЗона,
		|	Итог.ПриборУчета КАК ПриборУчета,
		|	Итог.РегистрируетОбъем КАК РегистрируетОбъем,
		|	Итог.ВидПараметра КАК ВидПараметра,
		|	Итог.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	Итог.ВидКанальности КАК ВидКанальности
		|ПОМЕСТИТЬ СоставныеУслугиТУ
		|ИЗ
		|	Итог КАК Итог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставныеУслугиТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	СоставныеУслугиТУ.ТочкаУчета КАК ТочкаУчета,
		|	СоставныеУслугиТУ.Шкала КАК Шкала,
		|	СоставныеУслугиТУ.Услуга КАК Услуга,
		|	СоставныеУслугиТУ.ВидДифференцированности КАК ВидДифференцированности,
		|	СоставныеУслугиТУ.ТарифнаяЗона КАК ТарифнаяЗона,
		|	СоставныеУслугиТУ.ПриборУчета КАК ПриборУчета,
		|	СоставныеУслугиТУ.РегистрируетОбъем КАК РегистрируетОбъем,
		|	СоставныеУслугиТУ.ВидПараметра КАК ВидПараметра,
		|	СоставныеУслугиТУ.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	СоставныеУслугиТУ.ВидКанальности КАК ВидКанальности,
		|	энргВидыУслугСоставляющиеУслуг.Услуга КАК ПростаяУслуга,
		|	энргВидыУслуг.СоставнаяУслуга КАК СоставнаяУслуга
		|ПОМЕСТИТЬ ПростыеУслугиТУ
		|ИЗ
		|	СоставныеУслугиТУ КАК СоставныеУслугиТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|		ПО СоставныеУслугиТУ.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
		|		ПО СоставныеУслугиТУ.Услуга = энргВидыУслуг.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПростыеУслугиТУ.ОбъектРасчета КАК ОбъектРасчета,
		|	ПростыеУслугиТУ.ТочкаУчета КАК ТочкаУчета,
		|	ПростыеУслугиТУ.Шкала КАК Шкала,
		|	ПростыеУслугиТУ.Услуга КАК Услуга,
		|	ПростыеУслугиТУ.ВидДифференцированности КАК ВидДифференцированности,
		|	ПростыеУслугиТУ.ТарифнаяЗона КАК ТарифнаяЗона,
		|	ПростыеУслугиТУ.ПриборУчета КАК ПриборУчета,
		|	ПростыеУслугиТУ.РегистрируетОбъем КАК РегистрируетОбъем,
		|	ПростыеУслугиТУ.ВидПараметра КАК ВидПараметра,
		|	ПростыеУслугиТУ.РасположениеИзмерителя КАК РасположениеИзмерителя,
		|	ПростыеУслугиТУ.ВидКанальности КАК ВидКанальности,
		|	ПростыеУслугиТУ.ПростаяУслуга КАК ПростаяУслуга,
		|	бестПоставщикиУслугНПСрезПоследних.Поставщик КАК Поставщик
		|ИЗ
		|	ПростыеУслугиТУ КАК ПростыеУслугиТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестПоставщикиУслугНП.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район) КАК бестПоставщикиУслугНПСрезПоследних
		|		ПО ПростыеУслугиТУ.ТочкаУчета = бестПоставщикиУслугНПСрезПоследних.ТочкаУчета
		|			И ПростыеУслугиТУ.ПростаяУслуга = бестПоставщикиУслугНПСрезПоследних.Услуга
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТочкаУчета,
		|	Шкала";
	
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Период", 		Период);
	Запрос.УстановитьПараметр("Район", 			Район);
	
	Возврат Запрос.Выполнить();
КонецФункции

#КонецОбласти

#КонецЕсли
